<?php

namespace App\Console;

use DI\Container;
use Symfony\Component\Console\Command\Command;
use Symfony\Component\Console\Input\InputInterface;
use Symfony\Component\Console\Output\OutputInterface;

class DbFillUsersCommand extends Command
{
    private Container $container;

    public function __construct(Container $container)
    {
        parent::__construct();

        $this->container = $container;
    }

    protected function configure(): void
    {
        parent::configure();

        $this->setName('fill_users_table');
        $this->setDescription('Command to fill users table with random test data.');
    }

    protected function execute(InputInterface $input, OutputInterface $output): int
    {
        $pdo = $this->container->get('pdo');

        $firstNames = ["Абрам", "Аваз", "Аввакум", "Август", "Авдей", "Авраам", "Автандил", "Агап", "Агафон",
            "Аггей", "Адам", "Адис", "Адольф", "Адриан", "Азамат", "Азарий", "Азат", "Айдар", "Айнур", "Айрат",
            "Акакий", "Аким", "Алан", "Александр", "Алексей", "Али", "Алихан", "Алмаз", "Альберт", "Альфред",
            "Амадей", "Амадеус", "Амаяк", "Амин", "Амвросий", "Анатолий", "Анвар", "Ангел", "Андрей", "Андрэ",
            "Аникита", "Антон", "Ануфрий", "Анфим", "Аполлинарий", "Арам", "Аристарх", "Аркадий", "Арман",
            "Армен", "Арно", "Арнольд", "Арон", "Арсен", "Арсений", "Арслан", "Артем", "Артемий", "Артур",
            "Архип", "Аскольд", "Афанасий", "Ахмет", "Ашот", "Бахрам", "Бежен", "Бенедикт", "Берек", "Бернар",
            "Богдан", "Боголюб", "Бонифаций", "Бореслав", "Борис", "Борислав", "Боян", "Бронислав", "Бруно",
            "Булат", "Вадим", "Валентин", "Валерий", "Вальдемар", "Вальтер", "Вардан", "Варлаам",
            "Варфоломей", "Василий", "Ватслав", "Велизар", "Велор", "Венедикт", "Вениамин", "Викентий",
            "Виктор", "Вилен", "Вилли", "Вильгельм", "Виссарион", "Виталий", "Витаутас", "Витольд", "Владимир",
            "Владислав", "Владлен", "Влас", "Володар", "Всеволод", "Вячеслав", "Гавриил", "Галактион", "Гамлет",
            "Гарри", "Гаяс", "Гевор", "Геворг", "Геннадий", "Генри", "Генрих", "Георгий", "Геральд", "Герасим",
            "Герман", "Глеб", "Гоар", "Гордей", "Гордон", "Горислав", "Градимир", "Григорий", "Гурий", "Густав",
            "Давид", "Давлат", "Дамир", "Даниил", "Данислав", "Даньяр", "Демид", "Демьян", "Денис", "Джамал",
            "Джеймс", "Джереми", "Джозеф", "Джордан", "Джорж", "Дик", "Динар", "Динасий", "Дмитрий", "Добрыня",
            "Дональд", "Донат", "Донатос", "Дорофей", "Евгений", "Евграф", "Евдоким", "Евсей", "Евстафий", "Егор",
            "Елизар", "Елисей", "Емельян", "Еремей", "Ермолай", "Ерофей", "Ефим", "Ефрем", "Жан", "Ждан", "Жерар",
            "Закир", "Замир", "Заур", "Захар", "Зенон", "Зигмунд", "Зиновий", "Зураб", "Ибрагим", "Иван", "Игнат",
            "Игнатий", "Игорь", "Иероним", "Измаил", "Израиль", "Илиан", "Илларион", "Ильхам", "Ильшат", "Илья",
            "Ильяс", "Инокентий", "Иоанн", "Иоаким", "Ион", "Иосиф", "Ипполит", "Ираклий", "Иса", "Исаак",
            "Исидор", "Искандер", "Ислам", "Исмаил", "Казбек", "Казимир", "Камиль", "Карен", "Карим", "Карл",
            "Ким", "Кир", "Кирилл", "Клавдий", "Клаус", "Клим", "Климент", "Клод", "Кондрат", "Константин",
            "Корней", "Корнилий", "Кузьма", "Лавр", "Лаврентий", "Лазарь", "Лев", "Леван", "Левон", "Ленар",
            "Леон", "Леонард", "Леонид", "Леонтий", "Леопольд", "Лука", "Лукьян", "Любим", "Любомир", "Людвиг",
            "Люсьен", "Люций", "Мавлюда", "Мадлен", "Май", "Майкл", "Макар", "Макарий", "Максим", "Максимильян",
            "Максуд", "Мансур", "Мануил", "Мар", "Марат", "Мариан", "Марк", "Марсель", "Мартин", "Матвей",
            "Махмуд", "Мераб", "Мефодий", "Мечеслав", "Микула", "Милан", "Мирон", "Мирослав", "Митрофан",
            "Михаил", "Мишлов", "Модест", "Моисей", "Мстислав", "Мурат", "Муслим", "Мухаммед", "Назар",
            "Назарий", "Наиль", "Натан", "Наум", "Нестор", "Никанор", "Никита", "Никифор", "Никодим", "Никола",
            "Николай", "Никон", "Нильс", "Нисон", "Нифонт", "Норманн", "Овидий", "Олан", "Олег", "Олесь", "Онисим",
            "Орест", "Орландо", "Осип", "Оскар", "Остап", "Павел", "Панкрат", "Парамон", "Петр", "Платон",
            "Порфирий", "Потап", "Прокофий", "Прохор", "Равиль", "Радий", "Радик", "Радомир", "Радослав",
            "Разиль", "Райан", "Раймонд", "Раис", "Рамазан", "Рамиз", "Рамиль", "Рамон", "Ранель", "Расим",
            "Расул", "Ратибор", "Ратмир", "Рафаил", "Рафаэль", "Рафик", "Рашид", "Рем", "Ринат", "Рифат",
            "Рихард", "Ричард", "Роберт", "Родион", "Ролан", "Роман", "Ростислав", "Рубен", "Рудольф", "Руслан",
            "Рустам", "Руфин", "Рушан", "Рэй", "Сабир", "Савва", "Савелий", "Самвел", "Самсон", "Самуил",
            "Святослав", "Севастьян", "Северин", "Семен", "Серафим", "Сергей", "Сидор", "Сократ", "Соломон",
            "Спартак", "Спиридон", "Стакрат", "Станислав", "Степан", "Стефан", "Стивен", "Стоян", "Султан",
            "Тагир", "Таис", "Тайлер", "Талик", "Тамаз", "Тамерлан", "Тарас", "Тельман", "Теодор", "Терентий",
            "Тибор", "Тиграм", "Тигран", "Тигрий", "Тимофей", "Тимур", "Тит", "Тихон", "Томас", "Трифон", "Трофим",
            "Ульманас", "Умар", "Устин", "Фадей", "Фазиль", "Фанис", "Фарид", "Фархад", "Федор", "Федот", "Феликс",
            "Феодосий", "Фердинанд", "Фидель", "Филимон", "Филипп", "Флорентий", "Фома", "Франц", "Фред",
            "Фридрих", "Фуад", "Хабиб", "Хаким", "Харитон", "Христиан", "Христос", "Христофор", "Цезарь",
            "Чарльз", "Чеслав", "Чингиз", "Шамиль", "Шарль", "Эдвард", "Эдгар", "Эдмунд", "Эдуард", "Эльдар",
            "Эмиль", "Эмин", "Эммануил", "Эраст", "Эрик", "Эрнест", "Юлиан", "Юлий", "Юнус", "Юрий", "Юхим",
            "Яков", "Ян", "Януарий", "Ярослав", "Ясон"];

        $secondNames = [
            "Иванов", "Васильев", "Петров", "Смирнов", "Михайлов", "Фёдоров", "Соколов", "Яковлев", "Попов", "Андреев",
            "Алексеев", "Александров", "Лебедев", "Григорьев", "Степанов", "Семёнов", "Павлов", "Богданов", "Николаев",
            "Дмитриев", "Егоров", "Волков", "Кузнецов", "Никитин", "Соловьёв", "Тимофеев", "Орлов", "Афанасьев", "Филиппов",
            "Сергеев", "Захаров", "Матвеев", "Виноградов", "Кузьмин", "Максимов", "Козлов", "Ильин", "Герасимов", "Марков",
            "Новиков", "Морозов", "", "Романов", "Осипов", "Макаров", "Зайцев", "Беляев", "Гаврилов", "Антонов", "Ефимов",
            "Леонтьев", "Давыдов", "Гусев", "Данилов", "Киселёв", "Сорокин", "Тихомиров", "Крылов", "Никифоров", "Кондратьев",
            "Кудрявцев", "Борисов", "Жуков", "Воробьёв", "Щербаков", "Поляков", "Савельев", "Шмидт", "Трофимов", "Чистяков",
            "Баранов", "Сидоров", "Соболев", "Карпов", "Белов", "Миллер", "Титов", "Львов", "Фролов", "Игнатьев", "Комаров",
            "Прокофьев", "Быков", "Абрамов", "Голубев", "Пономарёв", "Покровский", "Мартынов", "Кириллов", "Шульц", "Миронов",
            "Фомин", "Власов", "Троицкий", "Федотов", "Назаров", "Ушаков", "Денисов", "Константинов", "Воронин", "Наумов"
        ];

        $password = password_hash('vasya_3_2_1', PASSWORD_DEFAULT);

        for ($outerIterator = 0; $outerIterator < 100; $outerIterator++) {
            $sql = "INSERT INTO user(
            first_name,
            last_name,
            age,
            sex,
            interests,
            city_id,
            login,
            password) 
            VALUES ";

            for ($iterator = 0; $iterator < 10000; $iterator++) {
                $sql .= "(";
                $sql .= "'" . $firstNames[array_rand($firstNames)] . "', ";
                $sql .= "'" . $secondNames[array_rand($secondNames)] . "', ";
                $sql .= rand(6, 60) . ", ";
                $sql .= "1, ";
                $sql .= "'Byhat', ";
                $sql .= rand(1, 7) . ", ";
                $sql .= "'" . 'vasya_raz_dva_tri' . "', ";
                $sql .= "'" . $password;
                $sql .= "'), ";
            }

            $sql = substr($sql, 0, -2);
            $pdo->query($sql)->execute();
        }

        return Command::SUCCESS;
    }
}